from string import Template

#### RAG PROMPTS ####

#### SYSTEM ####

system_prompt = Template("\n".join([
                 "أنت مساعد لتوليد رد للمستخدم.",
                 "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
                 "يجب عليك إنشاء الرد بناءً على المستندات المقدمة.",
                 "تجاهل المستندات غير ذات الصلة باستفسار المستخدم.",
                 "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء رد مناسب.",
                 "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
                 "كن مهذبًا ومحترمًا في ردك على المستخدم.",
                 "كن دقيقًا ومختصرًا في إجابتك وتجنب المعلومات غير الضرورية."
                 ]))


#### Document ####
document_prompt = Template("\n".join([
    "## رقم المستند: $doc_num",
    "### المحتوى: $chunk_text",
]))


#### Footer ####
footer_prompt = Template("\n".join([
   "بناءً على المستندات أعلاه، يرجى إنشاء الإجابة للمستخدم.",
   "## السؤال:",
   "$query",
   "",
   "## الإجابة:",
   
]))